### Build Some Tables

In [90]:
import pandas as pd

employee = pd.DataFrame({'id':[1,2,3,4,5],
                'name': ['Joe','Kyle','Steve','Amanda','William'],
                'salary': [300,200,300,400,100],
                'departmentId': [1,2,1,2,2]})
dept = pd.DataFrame({'id':[1,2],
                     'name':['IT','Sales']})
dept.head()

   id   name
0   1     IT
1   2  Sales

### Update Column

In [91]:

dept.loc[dept['id'] == 1, 'name'] = 'Information Technology'
dept.head()

   id                    name
0   1  Information Technology
1   2                   Sales

### Join Tables

In [92]:
merged = employee.merge(dept,how='inner',left_on='departmentId',right_on='id',suffixes=('_emp','_dept'))

### Groupby Example for Getting the Max Salary

* It's important to note that this is a very nuanced way to do the groupby and that it is only done this way to get values from the original dataframe.

In [93]:
highest = merged[merged['salary'] == merged.groupby('departmentId')['salary'].transform('max')]
highest

   id_emp name_emp  salary  departmentId  id_dept               name_dept
0       1      Joe     300             1        1  Information Technology
2       3    Steve     300             1        1  Information Technology
3       4   Amanda     400             2        2                   Sales

### Another More Common Groupby

* Total Salary By Department

In [94]:
employee.head()
employee

   id     name  salary  departmentId
0   1      Joe     300             1
1   2     Kyle     200             2
2   3    Steve     300             1
3   4   Amanda     400             2
4   5  William     100             2

In [95]:
dept_salary_totals = employee.groupby('departmentId',as_index=False)['salary'].sum()
dept_salary_totals = dept_salary_totals.merge(dept,how='inner',left_on='departmentId',right_on='id')[['name','salary']]
dept_salary_totals.rename(columns={'name':'Department','salary':'Salary'},inplace=True)
dept_salary_totals.sort_values(by='Salary',inplace=True,ascending=False)
dept_salary_totals.head()

               Department  Salary
1                   Sales     700
0  Information Technology     600

In [96]:
employee.drop_duplicates(subset='salary',inplace=True)
employee

   id     name  salary  departmentId
0   1      Joe     300             1
1   2     Kyle     200             2
3   4   Amanda     400             2
4   5  William     100             2